EventModel/Documentation/README_EventModel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>EventModel: Connecting an Environment</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="EventModel: Connecting an Environment"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-06-28"/>
<meta name="author" content="IZ"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">EventModel: Connecting an Environment</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> EventModel</h2>
<div class="outline-text-2" id="text-1">


<p>
A subclass of Event which broadcasts update messages whenever one of its values changes. 
</p>
<p>
EventModel also has methods for creating gui widgets that write on its values. 
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> REQUIRES: Notification Class</h2>
<div class="outline-text-2" id="text-2">


<p>
Notification Class definition is found in: 
</p><pre class="example">
Snippets/SystemExtensions/Notification.sc
</pre>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-06-28</p>
<p class="author">Author: IZ</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
